IC.ДополненияКА/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5f80ee1-11ee-4805-9a52-c7edb03a422e">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="695d5be0-2491-490f-9689-78e3615b85de">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="9c3a50fe-c553-436b-9ff3-29e6bf5abe55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ba4dab77-7956-4903-8aff-17c9e06ea5fa">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

IC.ДополненияКА/src/InformationRegisters/РаспределениеЗапасов/РаспределениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45342faa-1ece-480b-81d1-d8e80e853d58">
  <name>РаспределениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="b1640808-e7c6-4807-936d-bd90cf45049d">
    <name>Свободно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="071db416-83a1-49bb-8727-0c50e9b7962d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="908bbc1b-86a0-43c8-b40a-a1c31cf89ac3">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7ebc9523-5df4-4dfc-ab70-41061e5b8b4f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2a3bab03-6376-456d-9d36-7b51914fe435">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

IC.ДополненияКА/src/Enums/РаспределениеЗапасовСостояния/РаспределениеЗапасовСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="545815ed-aef9-41ce-93e4-8bbe4895c3db">
  <name>РаспределениеЗапасовСостояния</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="47d10a43-5556-4259-bde6-880106968b77">
    <name>ОстатокНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

IC.ДополненияКА/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="344b6917-b413-4fae-aadd-d62836822de6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3ebfaae7-710d-4b97-aff3-149de91a4f89">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c122409e-0e2f-4354-a036-4e8f6440b616">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IC.ДополненияКА/src/CommonModules/ДКА_СобытияФормВызовСервера/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// Возвращает последние цены номенклатуры
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  Массив из Структура:
//	* ВидЦены - СправочникСсылка.ВидыЦен - Вид цены
//	* Цена - Число - Цена
Функция ЦеныНоменклатуры(Номенклатура) Экспорт

	НаборЦен = Новый Массив;

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Цены.ВидЦены КАК ВидЦены,
				   |	Цены.Цена КАК Цена
				   |ИЗ
				   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК Цены";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НаборЦен.Добавить(Новый Структура("ВидЦены, Цена", Выборка.ВидЦены, Выборка.Цена));
	КонецЦикла;

	Возврат НаборЦен;

КонецФункции

// Возвращает остатки номенклатуры
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  Массив из Структура:
//	* ВидЦены - СправочникСсылка.ВидыЦен - Вид цены
//	* Цена - Число - Цена
Функция ОстаткиНоменклатуры(Номенклатура) Экспорт

	НаборОстатков = Новый Массив;

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
				   |	РаспределениеЗапасов.Характеристика КАК Характеристика,
				   |	РаспределениеЗапасов.Склад КАК Склад,
				   |	СУММА(РаспределениеЗапасов.Свободно) КАК Свободно,
				   |	СУММА(РаспределениеЗапасов.ВНаличии - РаспределениеЗапасов.Свободно) КАК ВРезерве,
				   |	0 КАК ВПути
				   |ИЗ
				   |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
				   |ГДЕ
				   |	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
				   |	И РаспределениеЗапасов.Номенклатура = &Номенклатура
				   |СГРУППИРОВАТЬ ПО
				   |	РаспределениеЗапасов.Номенклатура,
				   |	РаспределениеЗапасов.Характеристика,
				   |	РаспределениеЗапасов.Склад
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
				   |	ТоварыКПоступлениюОстатки.Номенклатура,
				   |	ТоварыКПоступлениюОстатки.Характеристика,
				   |	ТоварыКПоступлениюОстатки.Склад,
				   |	0,
				   |	0,
				   |	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоНакладнымОстаток
				   |ИЗ
				   |	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
				   |ГДЕ
				   |	ТоварыКПоступлениюОстатки.Номенклатура = &Номенклатура";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НаборОстатков.Добавить(Новый Структура("Склад, Свободно, ВРезерве, ВПути",
											   Выборка.Склад,
											   Выборка.Свободно,
											   Выборка.ВРезерве,
											   Выборка.ВПути));
	КонецЦикла;

	Возврат НаборОстатков;

КонецФункции

Функция Применимость(Номенклатура) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
				   |	НоменклатураДополнительныеРеквизиты.Значение КАК Применимость
				   |ИЗ
				   |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
				   |ГДЕ
				   |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
				   |	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", ПараметрыСеанса.АА_СвойствоНаименованиеПолное);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() И Не ПустаяСтрока(Выборка.Применимость) Тогда
		Результат = СтрЗаменить(Выборка.Применимость, " / ", Символы.ПС);
	Иначе
		Результат = "Модели по автокаталогу не назначены";
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти
